# Data Quality Assessment

The organisation "Sprocket Central Pty Ltd." has a large dataset relating to its customers, but their team is unsure how to effectively analyse it to help optimise its marketing strategy.

The client "Sprocket Central Pty Ltd." provided KPMG with 3 datasets:

1. Customer Demographic 
2. Customer Addresses
3. Transactions data in the past 3 months

## Analyzing the Transactions dataset

In [1]:
import pandas as pd

In [2]:
transactions_df = pd.read_excel(r"C:\Users\Srividhya\Desktop\KPMG dataset\kpmg_dataset.xlsx", sheet_name = "Transactions", header = 1)

In [3]:
transactions_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [5]:
transactions_df.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [7]:
transactions_df.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

We can see that the 'products_first_sold_date' is not in the correct format of date as expected. So the pandas 'to_datetime' method is used to convert it to date format as required.

In [8]:
transactions_df['product_first_sold_date'] = pd.to_datetime(transactions_df['product_first_sold_date'])

In [28]:
transactions_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,1970-01-01 00:00:00.000041245
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,1970-01-01 00:00:00.000041701
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1970-01-01 00:00:00.000036361
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,1970-01-01 00:00:00.000036145
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,1970-01-01 00:00:00.000042226

Now, the datatypes of all columns seems to be good and precise. Let's check the datatypes once again.

In [9]:
transactions_df.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date    datetime64[ns]
dtype: object

In [10]:
transactions_df.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

There are many null values in various columns. 

These null values can be avoided either by:
1. dropping the columns
2. filling them with mean or most frequent values.
3. fill them with 0.

I prefer to fill the missing values by most frequent values. So the first issue in the dataset is the presence of null values.

In [13]:
transactions_df.duplicated().sum()

0

There are no duplicate values. So there is no issue in this phase.

In [18]:
transactions_df.nunique()

transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

In [19]:
transactions_df['online_order'].value_counts()

1.0    9829
0.0    9811
Name: online_order, dtype: int64

In [20]:
transactions_df['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [21]:
transactions_df['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [22]:
transactions_df['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [23]:
transactions_df['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [24]:
transactions_df['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [27]:
transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
transaction_id             20000 non-null int64
product_id                 20000 non-null int64
customer_id                20000 non-null int64
transaction_date           20000 non-null datetime64[ns]
online_order               19640 non-null float64
order_status               20000 non-null object
brand                      19803 non-null object
product_line               19803 non-null object
product_class              19803 non-null object
product_size               19803 non-null object
list_price                 20000 non-null float64
standard_cost              19803 non-null float64
product_first_sold_date    19803 non-null datetime64[ns]
dtypes: datetime64[ns](2), float64(3), int64(3), object(5)
memory usage: 2.0+ MB

Thus, the transactions dataset is clear and has only the issue of 
###### "presence of null values" 
which can be stragetically solved easily.

## Analysis of the new customers list dataset

In [25]:
newcust_df = pd.read_excel(r"C:\Users\Srividhya\Desktop\KPMG dataset\kpmg_dataset.xlsx", sheet_name = "NewCustomerList", header = 1)

In [26]:
newcust_df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.56,0.7000,0.8750,0.743750,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.89,0.8900,1.1125,0.945625,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.01,1.0100,1.0100,1.010000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.87,1.0875,1.0875,1.087500,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.52,0.5200,0.6500,0.650000,4,4,1.703125

In [29]:
newcust_df.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [30]:
newcust_df.dtypes

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Unnamed: 16                                   float64
Unnamed: 17                                   float64
Unnamed: 18                                   float64
Unnamed: 19                                   float64
Unnamed: 20                                     int64
Rank                                            int64
Value                                         float64
dtype: object

In [31]:
newcust_df.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [33]:
newcust_df.duplicated().sum()

0

In [34]:
newcust_df.nunique()

first_name                              940
last_name                               961
gender                                    3
past_3_years_bike_related_purchases     100
DOB                                     958
job_title                               184
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        1
owns_car                                  2
tenure                                   23
address                                1000
postcode                                522
state                                     3
country                                   1
property_valuation                       12
Unnamed: 16                              71
Unnamed: 17                             132
Unnamed: 18                             183
Unnamed: 19                             321
Unnamed: 20                             324
Rank                                    324
Value                                   324
dtype: int64

##### From the above insight, it is clear that there are few unnamed columns namely "Unnamed: 16", "Unnamed: 17" and so on. But their values are huge. So it is necessary to think wisely in making a decision to either drop those columns or rename them with useful terms.

In [36]:
newcust_df['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [37]:
newcust_df['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [38]:
newcust_df['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [42]:
newcust_df['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [39]:
newcust_df['deceased_indicator'].value_counts()

N    1000
Name: deceased_indicator, dtype: int64

In [40]:
newcust_df['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [41]:
newcust_df['country'].value_counts()

Australia    1000
Name: country, dtype: int64

In [43]:
newcust_df['property_valuation'].value_counts()

9     173
8     162
7     138
10    116
6      70
11     62
5      57
4      53
3      51
12     46
2      42
1      30
Name: property_valuation, dtype: int64

Other than the unnamed columns, there seems to be no potential issues in the NewCustomerList dataset.

While thinking about the issue of Unnamed columns, since it contains huge amount of data with itself, it is not wise to drop the columns since they may contain any potential value of information. So, it is better if we ask the client and rectify about the Unnamed columns and then decide on the steps to make it correct.

Considering the situation now, dropping those columns can make the dataset neat for further purposes.

In [44]:
newcust_df.drop(columns=['Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20'], inplace=True)

In [45]:
newcust_df.dtypes

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Rank                                            int64
Value                                         float64
dtype: object

In [46]:
newcust_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
first_name                             1000 non-null object
last_name                              971 non-null object
gender                                 1000 non-null object
past_3_years_bike_related_purchases    1000 non-null int64
DOB                                    983 non-null datetime64[ns]
job_title                              894 non-null object
job_industry_category                  835 non-null object
wealth_segment                         1000 non-null object
deceased_indicator                     1000 non-null object
owns_car                               1000 non-null object
tenure                                 1000 non-null int64
address                                1000 non-null object
postcode                               1000 non-null int64
state                                  1000 non-null object
country                                1000 non-null object
property_valuation                     1000 non-null int64
Rank                                   1000 non-null int64
Value                                  1000 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(5), object(11)
memory usage: 140.7+ KB

In [47]:
newcust_df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

## Analysing the Customer Demographic dataset

In [48]:
custdemo_df = pd.read_excel(r"C:\Users\Srividhya\Desktop\KPMG dataset\kpmg_dataset.xlsx", sheet_name = "CustomerDemographic", header = 1)

In [49]:
custdemo_df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [50]:
custdemo_df.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [51]:
custdemo_df.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

###### As from the above output, we can find that there is this column named "default" which looks like of no use to the dataset. Let's have a look at the column's values.

In [52]:
custdemo_df['default'].value_counts()

100                                                                                                                                                                                                                   113
1                                                                                                                                                                                                                     112
-1                                                                                                                                                                                                                    111
-100                                                                                                                                                                                                                   99
Ã™Â¡Ã™Â¢Ã™Â£                                                                                                                                                                                                                 53
Ã¢Â°Ã¢Â´Ã¢ÂµÃ¢Ã¢Ã¢                                                                                                                                                                                                              53
Ã¯Â½Ã¯Â½Â¨(Ã‚Â´Ã¢Ã¯Â½Ã¢Â©                                                                                                                                                                                                          52
../../../../../../../../../../../etc/passwd%00                                                                                                                                                                         50
Ã¢Â°Ã¢Â´Ã¢Âµ                                                                                                                                                                                                                 48
!@#$%^&*()                                                                                                                                                                                                             48
Ã¢Â¦testÃ¢Â§                                                                                                                                                                                                               47
(Ã¯Â¾Ã Â²Â¥Ã§Ã Â²Â¥Ã¯Â¼Ã¯Â¾Ã¯Â»Â¿ Ã¢Â»Ã¢Ã¢Â»                                                                                                                                                                                                45
Ã˜Â«Ã™ Ã™Ã™Ã˜Â³ Ã˜Â³Ã™Ã˜Â·Ã˜Âª Ã™Ã˜Â¨Ã˜Â§Ã™Ã˜ÂªÃ˜Â­Ã˜Â¯Ã™Ã˜Â¯Ã˜, Ã˜Â¬Ã˜Â²Ã™Ã˜Â±Ã˜ÂªÃ™ Ã˜Â¨Ã˜Â§Ã˜Â³Ã˜ÂªÃ˜Â®Ã˜Â¯Ã˜Â§Ã™ Ã˜Â£Ã™ Ã˜Â¯Ã™Ã™. Ã˜Â¥Ã˜Â° Ã™Ã™Ã˜Â§Ã˜ Ã˜Â§Ã™Ã˜Â³Ã˜ÂªÃ˜Â§Ã˜Â± Ã™Ã˜ÂªÃ™Ã˜ÂµÃ™Ã˜Â¨ Ã™Ã˜Â§Ã™. Ã˜Â£Ã™Ã™Ã™ Ã˜Â§Ã™Ã˜Â·Ã˜Â§Ã™Ã™Ã˜Â§Ã˜ Ã˜Â¨Ã˜Â±Ã™Ã˜Â·Ã˜Â§Ã™Ã™Ã˜Â§-Ã™Ã˜Â±Ã™Ã˜Â³Ã˜Â§ Ã™Ã˜Â¯ Ã˜Â£Ã˜Â®Ã˜Â°. Ã˜Â³Ã™Ã™Ã™Ã˜Â§Ã™Ã˜ Ã˜Â¥Ã˜ÂªÃ™Ã˜Â§Ã™Ã™Ã˜Â© Ã˜Â¨Ã™Ã™ Ã™Ã˜Â§, Ã™Ã˜Â°Ã™Ã˜Â± Ã˜          44
Ã¢                                                                                                                                                                                                                      43
0/0                                                                                                                                                                                                                    43
Ã…Ã¢Ã‚Â´Ã¢Â°Ã‹ÃƒÃ‚Â¨Ã‹ÃƒÃ¢Ã¢Ã¢                                                                                                                                                                                                        43
__Ã¯Â¾(,_,*)                                                                                                                                                                                                             43
ÃŒÂ¦HÃÃŒÂ¬ÃŒÂ¤ÃŒÃŒÂ¤eÃ ÃÃŒÃŒÂ¥ÃŒÃŒÂ»ÃÃŒwÃŒhÃŒÃŒÂ¯ÃoÃŒÃÃŒÃÃŒÂ±ÃŒÂ® Ã’ÃŒÂºÃŒÃŒÃŒÃWÃŒÂ·ÃŒÂ¼ÃŒÂ­aÃŒÂºÃŒÂªÃiÃŒÂ¨ÃÃÃŒÂ­ÃÃŒÂ¯ÃŒtÃŒÂ¶ÃŒÂ¼ÃŒÂ®sÃŒÃŒÃÃ ÃŒÂ ÃŒÂ«ÃŒÂ BÃŒÂ»ÃÃÃÃÃŒÂ³eÃŒÂµhÃŒÂµÃŒÂ¬ÃÃŒÂ«ÃiÃŒÃŒÂ¹ÃÃŒÂ³ÃŒÂ³ÃŒÂ®ÃÃŒÂ«nÃdÃŒÂ´ÃŒÂªÃŒÃŒ ÃÃŒÂ°ÃÃŒÂ©ÃÃÃÃŒÂ²TÃÂ¢ÃÃŒÂ¼ÃÃŒÂªhÃÃÃŒÂ®ÃŒÂ»eÃŒÂ¬ÃŒÃÃŒ ÃŒÂ¤ÃŒÂ¹ÃŒWÃÃÃÃŒÃŒÃÃaÃÃÃÃŒÂ¹ÃŒÂ¼                         43
ZÃŒÂ®ÃŒÃÃŒÂ ÃÃAÃŒÂ¥ÃŒÃŒÃÃŒÂ»ÃŒLÃŒÂ£ÃÃÃŒÂ¯ÃŒÂ¹ÃŒÃGÃŒÂ»OÃŒÂ­ÃŒÃŒÂ®                                                                                                                                                                                 43
1000000000000000049861653971908893017010268485438462151574892930611988399099305815384459015356416                                                                                                                      43
nil                                                                                                                                                                                                                    42
TÃŒÃŒÂ­ÃŒÂºÃŒÂºoÃ ÃŒÂ·iÃŒÂ²ÃŒÂ¬ÃÃŒÂªÃnÃŒÃŒÃvÃÃŒÃŒÃŒÃŒÂ¦oÃŒÂ¶ÃŒÃŒÂ°ÃŒÂ keÃÃÃŒÂ®ÃŒÂºÃŒÂªÃŒÂ¹ÃŒÂ±ÃŒÂ¤ ÃŒtÃÃŒÃÃŒÂ³ÃŒÂ£ÃŒÂ»ÃŒÂªhÃŒÂ¼ÃÃŒÂ²ÃŒÂ¦ÃŒÂ³ÃŒÃŒÂ²eÃÃŒÂ£ÃŒÂ°ÃŒÂ¦ÃŒÂ¬Ã ÃŒÂ¢ÃŒÂ¼ÃŒÂ»ÃŒÂ±ÃŒhÃÃÃÃÃŒÃŒÂ£ÃŒÂ²iÃŒÂ¦ÃŒÂ²ÃŒÂ£ÃŒÂ°ÃŒÂ¤vÃŒÂ»ÃeÃŒÂºÃŒÂ­ÃŒÂ³ÃŒÂªÃŒÂ°-mÃŒÂ¢iÃnÃŒÃŒÂºÃŒÃŒÂ²ÃŒÂ¯ÃŒÂ°dÃŒÂµÃŒÂ¼ÃŒÃÃŒÂ©ÃŒÂ¼ÃŒÃŒÂ³ ÃŒÃŒÂ¥ÃŒÂ±ÃŒÂ³ÃŒÂ­rÃŒÃŒÃŒeÃpÃÂ rÃŒÂ¼ÃŒÃŒÂ»ÃŒÂ­ÃŒeÃÃŒÂºÃŒÂ ÃŒÂ£sÃŒ     42
Ã¡                                                                                                                                                                                                                      42
`Ã¢Ã¢Â¬Ã¢Â¹Ã¢ÂºÃ¯Â¬Ã¯Â¬Ã¢Â¡Ã‚Â°Ã‚Â·Ã¢Ã¢Ã‚Â±                                                                                                                                                                                                 42
Ã‚Â¸Ã‹ÃƒÃ¢Ã„Â±Ã‹ÃƒÃ‚Â¯Ã‹Ã‚Â¿                                                                                                                                                                                                         42
Ã…Ã¢Ã‚Â´Ã‚Â®Ã¢Â Ã‚Â¥Ã‚Â¨Ã‹ÃƒÂ¸ÃÃ¢Ã¢                                                                                                                                                                                                     42
Ã£Ã£Â¼Ã£Ã£Â£Ã£Â¼Ã£Â¸Ã¨Â¡Ã£Ã£ÂªÃ£Ã£                                                                                                                                                                                                      41
Ã¬Â¬Ã­ÃªÂ³Â¼Ã­Ã¬ Ã¬Â´Ã­Ã¬Â°ÃªÂµÂ¬Ã¬                                                                                                                                                                                                     41
Ã¢Â«testÃ¢Â«                                                                                                                                                                                                               41
Ã¢Ã¢Ã¢                                                                                                                                                                                                                    41
                                                                                                                                                                                                                     ...
Ã°Âµ Ã° Ã° Ã°                                                                                                                                                                                                               36
(Ã¯Â½Â¡Ã¢ Ã¢ Ã¢Ã¯Â½Â¡)                                                                                                                                                                                                          36
1;DROP TABLE users                                                                                                                                                                                                     36
Ã°Â©Ã°Â½                                                                                                                                                                                                                   35
2018-02-01 00:00:00                                                                                                                                                                                                    35
(Ã¢Â¯Ã‚Â°Ã¢Â¡Ã‚Â°Ã¯Â¼Ã¢Â¯Ã¯Â¸Âµ Ã¢Â»Ã¢Ã¢Â»)                                                                                                                                                                                                35
Ã¯Â¾Ã¯Â½Â¥Ã¢Â¿Ã£Â¾Ã¢Â²(Ã¯Â½Â¡Ã¢Ã¢Â¿Ã¢Ã¯Â½Â¡)Ã¢Â±Ã¢Â¿Ã¯Â½Â¥Ã¯Â¾                                                                                                                                                                                       35
<>?:"{}|_+                                                                                                                                                                                                             35
NIL                                                                                                                                                                                                                    34
../../../../../../../../../../../etc/hosts                                                                                                                                                                             34
''''"                                                                                                                                                                                                                  33
Ã§Â°Ã¤Â¸Â­Ã£Ã£Ã£Â«Ã£Ã£Ã£Â¦Ã¤Â¸Ã£Ã£                                                                                                                                                                                                      33
1'; DROP TABLE users--                                                                                                                                                                                                 33
Ã£Â»(Ã¯Â¿Â£Ã¢Ã¯Â¿Â£)Ã£Â»:*:                                                                                                                                                                                                       33
<script>alert('hi')</script>                                                                                                                                                                                           33
Ã©Â¨Ã¨Â½Ã¦Â Â¼                                                                                                                                                                                                                33
Ã—Ã–Â¸Ã—Ã–Â°Ã—ÂªÃ–Â¸Ã—testÃ˜Â§Ã™Ã˜ÂµÃ™Ã˜Â­Ã˜Â§Ã˜Âª Ã˜Â§Ã™Ã˜ÂªÃ™Ã˜Â­Ã™Ã™                                                                                                                                                                                 32
ÃŒÂ¡ÃÃÃŒIÃÃŒÃŒÃŒÂ¦nÃÃÃvÃŒÂ®ÃŒÂ«okÃŒÂ²ÃŒÂ«ÃŒÃiÃŒÃÃŒÂ­ÃŒÂ¹ÃŒÂ ÃŒnÃŒÂ¡ÃŒÂ»ÃŒÂ®ÃŒÂ£ÃŒÂºgÃŒÂ²ÃÃÃŒÂ­ÃÃŒÂ¬Ã ÃŒÂ°tÃÃŒÂ¦hÃŒÃŒÂ²eÃŒÂ¢ÃŒÂ¤ ÃÃŒÂ¬ÃŒÂ²ÃfÃŒÂ´ÃŒÃÃŒÂ£eÃÃeÃŒÂ£ÃŒÂ¥ÃŒÂ©lÃÃÃiÃÂ ÃÃÃŒÂ¦nÃÃÃŒÃÃŒÂ³ÃŒÂ®gÃ ÃŒÂ¨oÃÂ¡ÃÃŒÂªfÃŒÃŒÂ£ÃŒÂ¬ ÃŒÃŒÃÃŒÃÃŒÂ®cÃ’ÃÃŒÂ«ÃÃÃÃÃhÃŒÂµÃŒÂ¤ÃŒÂ£ÃÃaÃÃŒÃŒÂ¼ÃÃoÃŒÂ¼ÃŒÂ£ÃŒÂ¥sÃÂ¢ÃŒÂ±ÃÃŒÂºÃŒÃŒÂ¦ÃŒÂ».ÃŒÃŒ                     32
Ã¢Â¢                                                                                                                                                                                                                     32
Ã£                                                                                                                                                                                                                      32
-0.5                                                                                                                                                                                                                   32
Ã°Â¾ Ã° Ã° Ã° Ã° Ã° Ã° Ã°                                                                                                                                                                                                       31
Ã§Â¤Â¾Ã¦Ã§Â§Ã¥Â­Â¸Ã©Â¢Ã¨ÂªÃ¥Â­Â¸Ã§Â Ã§Â©Â¶Ã¦                                                                                                                                                                                                 31
testÃ¢Â testÃ¢Â«                                                                                                                                                                                                           31
'"''''"                                                                                                                                                                                                                31
<img src=x onerror=alert('hi') />                                                                                                                                                                                      31
/dev/null; touch /tmp/blns.fail ; echo                                                                                                                                                                                 30
Ã¢ÂªÃ¢ÂªtestÃ¢Âª                                                                                                                                                                                                             29
Ã¬Â¸Ã«Ã«Â°Ã­Â Ã«Â¥Â´                                                                                                                                                                                                             27
,Ã£Ã£Â»:*:Ã£Â»Ã£Ã¢( Ã¢Â» Ã Ã¢Â» )Ã£Ã£Â»:*:Ã£Â»Ã£Ã¢                                                                                                                                                                                       25
Name: default, Length: 90, dtype: int64

###### As expected, the "default" column contains values with special characters and those which are not meaningful. So it is good to drop the column.

In [53]:
custdemo_df.drop(columns='default', inplace=True)

In [54]:
custdemo_df.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                        float64
dtype: object

In [55]:
custdemo_df.duplicated().sum()

0

In [56]:
custdemo_df.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [57]:
custdemo_df.nunique()

customer_id                            4000
first_name                             3139
last_name                              3725
gender                                    6
past_3_years_bike_related_purchases     100
DOB                                    3448
job_title                               195
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        2
owns_car                                  2
tenure                                   22
dtype: int64

In [58]:
custdemo_df['gender'].value_counts()

Female    2037
Male      1872
U           88
M            1
Femal        1
F            1
Name: gender, dtype: int64

###### When analyzing the values of gender column, it is seen that different formats are used for classifying the genders. So, it is necessary to make the column consistent. So, we can replace the values by standard format "Male", "Female", and "Unidentified".

In [60]:
custdemo_df['gender'].replace(['F','Femal'],'Female', inplace=True)

In [61]:
custdemo_df['gender'].replace('M','Male', inplace=True)

In [62]:
custdemo_df['gender'].replace('U','Unidentified', inplace=True)

In [63]:
custdemo_df['gender'].value_counts()

Female          2039
Male            1873
Unidentified      88
Name: gender, dtype: int64

###### Now the gender column looks meaningful and consistent.

In [64]:
custdemo_df['wealth_segment'].value_counts()

Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64

In [65]:
custdemo_df['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [67]:
custdemo_df['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64

In [68]:
custdemo_df['deceased_indicator'].value_counts()

N    3998
Y       2
Name: deceased_indicator, dtype: int64

In [69]:
custdemo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
customer_id                            4000 non-null int64
first_name                             4000 non-null object
last_name                              3875 non-null object
gender                                 4000 non-null object
past_3_years_bike_related_purchases    4000 non-null int64
DOB                                    3913 non-null datetime64[ns]
job_title                              3494 non-null object
job_industry_category                  3344 non-null object
wealth_segment                         4000 non-null object
deceased_indicator                     4000 non-null object
owns_car                               4000 non-null object
tenure                                 3913 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 375.1+ KB

In [70]:
custdemo_df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

###### Except the issue of "default" column, there is no other issue. Since we have dropped the "default" column, the dataset now looks accurate and meaningful.

## Analysis of Customer Address dataset

In [71]:
custaddress_df = pd.read_excel(r"C:\Users\Srividhya\Desktop\KPMG dataset\kpmg_dataset.xlsx", sheet_name = "CustomerAddress", header = 1)

In [72]:
custaddress_df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [73]:
custaddress_df.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [74]:
custaddress_df.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [75]:
custaddress_df.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [76]:
custaddress_df.duplicated().sum()

0

In [79]:
custaddress_df.nunique()

customer_id           3999
address               3996
postcode               873
state                    5
country                  1
property_valuation      12
dtype: int64

In [80]:
custaddress_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
customer_id           3999 non-null int64
address               3999 non-null object
postcode              3999 non-null int64
state                 3999 non-null object
country               3999 non-null object
property_valuation    3999 non-null int64
dtypes: int64(3), object(3)
memory usage: 187.5+ KB

###### This customer address dataset doesn't have any issues with it. It looks accurate and precisee and even it does not have any null values with it.

###### The customer demographic dataset and the customer address dataset have the "customer_id" column in common, so these two datasets can be merged together. It is not a necessary step but it can be useful.

In [81]:
custdemo_merged = pd.merge(custdemo_df, custaddress_df, on="customer_id")

In [82]:
custdemo_merged.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,0 Holy Cross Court,4211,QLD,Australia,9
3,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,Curr,Duckhouse,Male,35,1966-09-16,NaN,Retail,High Net Worth,N,Yes,13.0,9 Oakridge Court,3216,VIC,Australia,9

In [83]:
custdemo_merged['fullname'] = custdemo_merged['first_name'] + " " + custdemo_merged['last_name']

In [84]:
custdemo_merged.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,fullname
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,060 Morning Avenue,2016,New South Wales,Australia,10,Laraine Medendorp
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,6 Meadow Vale Court,2153,New South Wales,Australia,10,Eli Bockman
2,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,0 Holy Cross Court,4211,QLD,Australia,9,NaN
3,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,17979 Del Mar Point,2448,New South Wales,Australia,4,Sheila-kathryn Calton
4,6,Curr,Duckhouse,Male,35,1966-09-16,NaN,Retail,High Net Worth,N,Yes,13.0,9 Oakridge Court,3216,VIC,Australia,9,Curr Duckhouse

In [85]:
custdemo_merged['fullname'].head()

0        Laraine Medendorp
1              Eli Bockman
2                      NaN
3    Sheila-kathryn Calton
4           Curr Duckhouse
Name: fullname, dtype: object

In [86]:
newcust_df['fullname'] = newcust_df['first_name'] + " " + newcust_df['last_name']

In [88]:
newcust_df['fullname'].head()

0      Chickie Brister
1         Morly Genery
2    Ardelis Forrester
3         Lucine Stutt
4       Melinda Hadlee
Name: fullname, dtype: object

###### By combining the first_name and last_name into the fullname, I tried to combine the custdemo_merged dataframe and the new customer list dataset but there are no similarities between those two dataframes. So, it is better to leave them as it is without merging.

## Conclusion:

All the datasets provided by the client are explored and analyzed to check the quality of the data. Most of the issues are resolved but few of them are left into consideration.The datasets are analyzed to check the quality measures which includes Accuracy, validity, Currency, Completeness, Consistency, relevancy and uniqueness.